# GetTexSpace2DRadius

## Description
Function GetTexSpace2DRadius returns the radius of the referenced texture space for applicable mapping types.

```pascal
FUNCTION GetTexSpace2DRadius(textureSpace : HANDLE) : REAL;
```

```python

def vs.GetTexSpace2DRadius(textureSpace):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureSpace|HANDLE|Handle to texture space.|

## Remarks
For applicable mapping types, gets the radius of the texture space.

## Version
```diff
- GetTexSpace2DRadius is obsolete as of Vectorworks 2009
```

Availability: from VectorWorks8.0
## Category
* Textures